Revit 2027 API
EnergyAnalysisConstruction.HeatTransferCoefficient Property
Note: This API is now obsolete.
 The heat transfer coefficient value (U-value) of the construction, in W/(m^2*K) (equivalent to kg/(k*s^3)).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a later version of Revit. Use the ThermalTransmittance property instead.")]
public double HeatTransferCoefficient { get; }
<ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a later version of Revit. Use the ThermalTransmittance property instead.")>
Public ReadOnly Property HeatTransferCoefficient As Double
	Get
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2027 and may be removed in a later version of Revit. Use the ThermalTransmittance property instead.")]
property double HeatTransferCoefficient {
	double get ();
}
[<ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a later version of Revit. Use the ThermalTransmittance property instead.")>]
member HeatTransferCoefficient : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace